# CannotRegenerateCorruptFamily Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CannotRegenerateCorruptFamily Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Family [Family Name] is corrupt and its instances cannot be updated. Please reload the family to repair the project..
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotRegenerateCorruptFamily { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotRegenerateCorruptFamily As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotRegenerateCorruptFamily {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace